In [1]:
import pandas as pd

In [2]:
test = [1,10,100,1000]

In [3]:
testDF = pd.DataFrame(test)
testDF

      0
0     1
1    10
2   100
3  1000

In [4]:
testDF.columns =["test"]
testDF

   test
0     1
1    10
2   100
3  1000

In [5]:
import pandas as pd

In [6]:
data = {'name': ['A고객','B고객','C고객','D고객'],
'age': [27,40,33,29],
'stock_age': [2,10,5,1]}
dataFrame = pd.DataFrame(data)
print(dataFrame)

  name  age  stock_age
0  A고객   27          2
1  B고객   40         10
2  C고객   33          5
3  D고객   29          1

In [13]:
import pandas as pd
date = ['16.02.29', '16.02.26', '16.02.25', '16.02.24', '16.02.23']
date2 = ['17.02.29', '17.02.26', '17.02.25', '17.02.24', '17.02.23']
date_df = pd.DataFrame(date, columns=['date2'])
date_df2 = pd.DataFrame(date2, columns=['date23'])
final = pd.concat([date_df,date_df2], axis = 1)
final

      date2    date23
0  16.02.29  17.02.29
1  16.02.26  17.02.26
2  16.02.25  17.02.25
3  16.02.24  17.02.24
4  16.02.23  17.02.23

In [1]:
import pandas as pd
key = ['1']
value = ['q']

In [3]:
data = {'name': ['1번','2번',],
'age': ['27','0'],}
dataFrame = pd.DataFrame(data)
print(dataFrame)

  name age
0   1번  27
1   2번   0

In [8]:
dataFrame.drop(['age'], axis=1)

  name
0   1번
1   2번